/* plural annotations, plural page count, author */
"%1$d annotations on %2$d pages by %3$@" = "%1$d คำอธิบายประกอบใน %2$d เพจโดย %3$@";

/* plural annotations, single page count, author */
"%1$d annotations on 1 page by %2$@" = "%1$d คำอธิบายประกอบใน 1 เพจโดย %2$@";

/* header in PDF summary: single page PDF, multiple annotations all on a single page, no author (e.g. '3 annotations') */
"%d annotations" = "%d คำอธิบายประกอบ";

/* header in PDF summary: single page PDF, multiple annotations all on a single page, author (e.g. '3 annotations by Phil') */
"%d annotations by %@" = "%1$d คำอธิบายประกอบตาม %2$@";

/* header in PDF summary: multiple page PDF, multiple annotations on separate pages, no author (e.g. '3 annotations on 2 pages') */
"%d annotations on %d pages" = "%1$d คำอธิบายประกอบใน %2$d หน้า";

/* header in PDF summary: multiple page PDF, multiple annotations on separate pages, author (e.g. '3 annotations on 2 pages by Phil') */
"%d annotations on %d pages by %@" = "%1$d คำอธิบายประกอบใน %2$d เพจโดย %3$@";

/* header in PDF summary: multiple page PDF, multiple annotations all on a single page, no author (e.g. '3 annotations on 1 page') */
"%d annotations on 1 page" = "%d คำอธิบายประกอบใน 1 หน้า";

/* header in PDF summary: multiple page PDF, multiple annotations all on a single page, author (e.g. '3 annotations on 1 page by Phil') */
"%d annotations on 1 page by %@" = "%1$d คำอธิบายประกอบใน 1 เพจโดย %2$@";

/* header in PDF summary: single page PDF, 1 annotation, no author (e.g. '1 annotation') */
"1 annotation" = "1 คำอธิบายประกอบ";

/* header in PDF summary: single page PDF, 1 annotation, author (e.g. '1 annotation by Phil') */
"1 annotation by %@" = "1 คำอธิบายประกอบตาม %@";

/* header in PDF summary: multiple page PDF, 1 annotation, no author (e.g. '1 annotation on 1 page') */
"1 annotation on 1 page" = "1 คำอธิบายประกอบใน 1 หน้า";

/* single annotation, single page count, author */
"1 annotation on 1 page by %1$@" = "1 คำอธิบายประกอบใน 1 เพจโดย %1$@";

/* header in PDF summary: multiple page PDF, 1 annotation, author (e.g. '1 annotation on 1 page by Phil') */
"1 annotation on 1 page by %@" = "1 คำอธิบายประกอบใน 1 หน้าตาม %@";

/* Tooltip for the arrow button */
"Add arrows to your image" = "เพิ่มลูกศรในภาพของคุณ";

/* Tooltip for the emoticon stamps button */
"Add emoticons to your image" = "เพิ่มอีโมติคอนในภาพของคุณ";

/* Tooltip for the shapes button */
"Add shapes to your image" = "เพิ่มรูปทรงในภาพของคุณ";

/* Tooltip for the stamps button */
"Add stamps to your image" = "เพิ่มแสตมป์ในภาพของคุณ";

/* Tooltip for the text button */
"Add text to your image" = "เพิ่มข้อความในภาพของคุณ";

/* All */
"All" = "ทั้งหมด";

/* PDF menu item to display all pages */
"All Pages" = "ทุกเพจ";

/* Tooltip for the angry stamp button */
"Angry" = "โกรธ";

/* Annotated */
"Annotated" = "ใส่คำอธิบายประกอบแล้ว";

/* PDF menu item to display only annotated pages */
"Annotated Only" = "ใส่คำอธิบายประกอบเท่านั้น";

/* Accessibility description: PDF popup button to switch between displaying all or annotated pages */
"Annotation Filter" = "กรองคำอธิบายประกอบ";

/* Apply */
"Apply" = "ใช้";

/* Approved stamp default text
   Tooltip for the approved stamp button */
"Approved" = "อนุมัติ";

/* Arrow creation undo/redo name */
"Arrow" = "ลูกศร";

/* arrow First Time User Experience Label next to Tool Bar Item */
"arrow" = "ลูกศร";

/* Arrow Endpoint undo/redo name */
"Arrow Endpoint" = "จุดสิ้นสุดลูกศร";

/* Arrow Rotation undo/redo name */
"Arrow Rotation" = "การหมุนลูกศร";

/* Attach Label to stamp undo/redo name */
"Attach Label" = "ติดฉลาก";

/* Tooltip for the attention stamp button */
"Attention" = "โปรดทราบ";

/* Cancel */
"Cancel" = "ยกเลิก";

/* Change Text undo/redo name */
"Change Text" = "เปลี่ยนแปลงข้อความ";

/* First time UX: Properties */
"Choose size and color" = "เลือกขนาดและสี";

/* First time UX: Tools */
"Choose tools" = "เลือกเครื่องมือ";

/* Click to expand the canvas by %u points in this direction */
"Click to expand the canvas by %ld points in this direction" = "คลิกเพื่อขยายผ้าใบตาม %ld จุดในทิศทางนี้";

/* Click to expand the canvas in this direction */
"Click to expand the canvas in this direction" = "คลิกเพื่อขยายผ้าใบในทิศทางนี้";

/* Tooltip for the color button */
"Color" = "สี";

/* Color Change undo/redo name */
"Color Change" = "เปลี่ยนสี";

/* Tooltip for the cool stamp button */
"Cool" = "เยี่ยม";

/* Crop undo/redo name */
"Crop" = "ครอบตัด";

/* Crop Area undo/redo name for crop area on the canvas */
"Crop Area" = "พื้นที่ครอบตัด";

/* Crop button */
"Crop Image" = "ครอบตัดภาพ";

/* Tooltip for the expand/crop button */
"Crop your image" = "ครอบตัดภาพของคุณ";

/* Delete button title */
"Delete" = "ลบ";

/* Delete PDF Page
   Delete PDF Page undo/redo name */
"Delete Page" = "ลบหน้า";

/* draw First Time User Experience Label next to Tool Bar Item */
"draw" = "วาด";

/* Tooltip for the pens button */
"Draw on your image" = "วาดบนภาพของคุณ";

/* Ellipse creation undo/redo name
   Tooltip for the ellipse button */
"Ellipse" = "รูปวงรี";

/* Ellipse Rotate undo/redo name */
"Ellipse Rotate" = "หมุนรูปวงรี";

/* Ellipse Size undo/redo name */
"Ellipse Size" = "ขนาดรูปวงรี";

/* First Time User Experience Label next to Tool Bar Item */
"emoticon" = "อีโมติคอน";

/* Expand Canvas undo/redo name */
"Expand Canvas" = "ขยายผ้าใบ";

/* Happy stamp default text */
"Fantastic!" = "น่าอัศจรรย์!";

/* Flip undo/redo name */
"Flip" = "พลิก";

/* Angry stamp default text */
"Grrr" = "กรืออออ";

/* Tooltip for the happy stamp button */
"Happy" = "มีความสุข";

/* Cool! stamp default text */
"Hehe" = "ฮิฮิ";

/* Highlighter creation undo/redo name
   Tooltip for the highlighter button */
"Highlighter" = "เครื่องมือไฮไลต์";

/* Error description for when images are too large */
"Image is too large." = "ภาพขนาดใหญ่เกินไป";

/* Silly stamp default text */
"Kidding!" = "ล้อเล่น!";

/* Line creation undo/redo name
   Tooltip for the line button */
"Line" = "เส้น";

/* Line Endpoint undo/redo name */
"Line Endpoint" = "จุดสิ้นสุดเส้น";

/* Line Rotation undo/redo name */
"Line Rotation" = "การหมุนเส้น";

/* Marker creation undo/redo name
   Tooltip for the marker button */
"Marker" = "ตัวทำเครื่องหมาย";

/* Move undo/redo name */
"Move" = "ย้าย";

/* Nudge undo/redo name for selected elements on the canvas */
"Nudge" = "ดุน";

/* Skitch max canvas size alert OK button title */
"OK" = "ตกลง";

/* First Time User Experience Label next to Tool Bar Item */
"pan" = "แพน";

/* PDF with summary */
"PDF with summary" = "PDF พร้อมสรุป";

/* Perfect stamp default text
   Tooltip for the perfect stamp button */
"Perfect" = "ยอดเยี่ยม";

/* Tooltip for the unpinned button */
"Pin sub tools open" = "ปักหมุดเครื่องมือย่อยที่เปิด";

/* Pixelate undo/redo name */
"Pixelate" = "การเปลี่ยนพิกเซล";

/* First Time User Experience Label next to Tool Bar Item */
"pixelate" = "การเปลี่ยนพิกเซล";

/* Tooltip for the pixelate button */
"Pixelate your image" = "เปลี่ยนพิกเซลภาพของคุณ";

/* Tooltip for the question stamp button */
"Question" = "คำถาม";

/* Rectangle creation undo/redo name
   Tooltip for the rectangle button */
"Rectangle" = "สี่เหลี่ยม";

/* Rectangle Rotate undo/redo name */
"Rectangle Rotate" = "หมุนรูปสี่เหลี่ยม";

/* Rectangle Size undo/redo name */
"Rectangle Size" = "ขนาดรูปสี่เหลี่ยม";

/* Redo button */
"Redo" = "ทำซ้ำ";

/* Rejected stamp default text
   Tooltip for the rejected stamp button */
"Rejected" = "ปฏิเสธ";

/* Resize Canvas undo/redo name */
"Resize Canvas" = "ปรับขนาดผ้าใบ";

/* Tooltip for the resize button */
"Resize your image" = "ปรับขนาดภาพของคุณ";

/* Rotate undo/redo name */
"Rotate" = "หมุน";

/* Rotate Canvas undo/redo name */
"Rotate Canvas" = "หมุนผ้าใบ";

/* Rotate PDF Page undo/redo name */
"Rotate Page" = "หมุนเพจ";

/* Rotate PDF Page 90 degrees Clockwise */
"Rotate Page Clockwise" = "หมุนหน้าตามเข็มนาฬิกา";

/* Rotate PDF Page 90 degrees Counterclockwise */
"Rotate Page Counterclockwise" = "หมุนหน้าทวนเข็มนาฬิกา";

/* Rounded Rectangle creation undo/redo name
   Tooltip for the rounded rectangle button */
"Rounded Rectangle" = "สี่เหลี่ยมขอบโค้ง";

/* Rounded Rectangle Rotate undo/redo name */
"Rounded Rectangle Rotate" = "หมุนรูปสี่เหลี่ยมขอบโค้ง";

/* Rounded Rectangle Size undo/redo name */
"Rounded Rectangle Size" = "ขนาดรูปสี่เหลี่ยมขอบโค้ง";

/* First time UX: Overflow menu */
"Save, share and more" = "บันทึก ใช้ร่วมกัน และอื่นๆ";

/* Scale undo/redo name */
"Scale" = "มาตราส่วน";

/* shapes First Time User Experience Label next to Tool Bar Item */
"shapes" = "รูปทรง";

/* Tooltip for the silly stamp button */
"Silly" = "เซ่อซ่า";

/* Tooltip for the size button */
"Size" = "ขนาด";

/* Size Change undo/redo name */
"Size Change" = "เปลี่ยนขนาด";

/* Skitch JPG */
"Skitch JPG" = "Skitch JPG";

/* Skitch PDF */
"Skitch PDF" = "Skitch PDF";

/* Skitch PDF with summary */
"Skitch PDF with summary" = "Skitch PDF พร้อมสรุป";

/* Skitch PNG */
"Skitch PNG" = "Skitch PNG";

/* Skitch Summary */
"Skitch Summary" = "Skitch สรุป";

/* Stamp creation undo/redo name */
"Stamp" = "แสตมป์";

/* First Time User Experience Label next to Tool Bar Item */
"stamp" = "แสตมป์";

/* Stamp Tail Position undo/redo name */
"Stamp Tail Position" = "แสตมป์ตำแหน่งปลาย";

/* Annotation Summary */
"Summary" = "สรุป";

/* Tooltip for the surprise stamp button */
"Surprise" = "ประหลาดใจ";

/* Educational message for users if they tap twice without effect. */
"Tap & drag to draw" = "แตะและลากเพื่อวาด";

/* Text undo/redo name */
"Text" = "ข้อความ";

/* text for First Time User Experience Label next to Tool Bar Item */
"text" = "ข้อความ";

/* Text Font Change undo/redo name
   Text Font undo/redo name */
"Text Font Change" = "เปลี่ยนแบบอักษรข้อความ";

/* Text Move undo/redo name */
"Text Move" = "เลื่อนข้อความ";

/* Text Style Change undo/redo name
   Text Style undo/redo name */
"Text Style Change" = "เปลี่ยนรูปแบบข้อความ";

/* Surprise! stamp default text */
"Uh oh…" = "อูฮู้…";

/* Error description for when  image fails to load. */
"Unable to read document." = "ไม่สามารถอ่านเอกสารได้";

/* Undo button */
"Undo" = "เลิกทำ";

/* Tooltip for the pinned button */
"Unpin sub tools" = "ยกเลิกการปักหมุดเครื่องมือย่อย";

/* What? stamp default text */
"What?" = "อะไรนี่?";

/* Wow! stamp default text */
"Wow!" = "ว้าว!";

/* Skitch max canvas size alert message */
"You have reached the maximum size allowable for an image. If you would like to expand further please crop your image or use a lower resolution image." = "คุณได้ใช้ถึงขนาดสูงสุดที่อนุญาตของภาพแล้ว หากคุณต้องการขยายเพิ่มเติม โปรดครอบตัดภาพของคุณหรือใช้ภาพความละเอียดต่ำ";
